{
  "basics": {
    "name": "Ryan Connolly",
    "label": "Technical Lead | Senior Principal Software Engineer",
    "email": "ryanoc333@gmail.com",
    "summary": "Technical Lead & Senior Principal Software Engineer with extensive experience in ASP.NET Core, Angular, and cloud-based architectures. Skilled in building scalable backend services, frontend applications, and system integrations while leading architecture and mentoring cross-functional teams. Strong background in hands-on development, system design, and collaborating with stakeholders to drive technical solutions.",
    "location": {
      "city": "Brandon",
      "region": "FL",
      "countryCode": "US"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "ryanoc",
        "url": "https://github.com/ryanoc"
      }
    ]
  },
  "work": [
    {
      "name": "Dell Technologies",
      "position": "Senior Principal Software Engineer",
      "url": "https://www.dell.com",
      "startDate": "2021-08",
      "endDate": "2025-02",
      "summary": "Led key engineering initiatives, balancing hands-on development with leadership. Partnered with stakeholders to align technical solutions with business needs, guiding engineers in best practices and system architecture.",
      "highlights": [
        "Provided technical leadership and mentorship, guiding engineers in best practices, architecture, and problem-solving.",
        "Worked with product managers, business leaders, and application consumers to define technical requirements and drive development priorities.",
        "Led architectural decisions and strategic planning for identity management and global supply chain systems.",
        "Facilitated cross-team collaboration, ensuring alignment between technical solutions and business goals.",
        "Practiced paired programming, fostering team collaboration and knowledge sharing.",
        "Designed Kafka-based inter-service communication, enabling scalable, efficient data streaming.",
        "Developed and maintained 100+ automated Selenium/Moon tests, improving system reliability.",
        "Implemented Polly for HTTP resilience, centralizing retry policies and circuit breaking.",
        "Integrated Pactflow contract testing, enhancing microservice reliability.",
        "Developed API response stubbing middleware, replacing real API responses with static JSON for consistent test data.",
        "Contributed to Angular 18 front-end component development.",
        "Ensured data integrity using FluentValidation before dispatching JSON payloads to Kafka.",
        "Managed GitLab CI/CD pipelines for five applications, optimizing deployments.",
        "Practiced Agile/Scrum, including standups, sprint planning, and retrospectives.",
        "Tracked project milestones using Jira, ensuring transparency and accountability.",
        "Advocated Test Driven Development (TDD) to improve code quality and maintainability.",
        "Created Markdown documentation & Mermaid diagrams for knowledge sharing.",
        "Monitored KPIs & errors via Splunk, optimizing system performance.",
        "Ensured code quality & security compliance using SonarQube & Checkmarx."
      ]
    },
    {
      "name": "Tech Valley Talent",
      "position": "Senior Software Engineer",
      "url": "https://techvtal.com",
      "startDate": "2020-09",
      "endDate": "2021-08",
      "summary": "Developed new applications for the New York Workers' Compensation Board, focusing on modernization and cloud-based architectures.",
      "highlights": [
        "Developed applications in C#, ASP.NET Core, Angular, and Azure.",
        "Built microservices using MediatR with Azure Service Bus.",
        "Led security enhancements and integration with state client systems.",
        "Authored unit and integration tests to support CI/CD pipelines.",
        "Participated in code reviews, agile ceremonies, and defect triaging."
      ]
    },
    {
      "name": "Nextech Systems",
      "position": "Senior Software Engineer",
      "url": "https://www.nextech.com",
      "startDate": "2020-05",
      "endDate": "2020-09",
      "summary": "Enhanced healthcare applications across a broad tech stack.",
      "highlights": [
        "Supported and enhanced applications in C++, C#, ASP.Net, AngularJS, Angular 7, and SQL Server.",
        "Troubleshot application integrations across Azure Cloud and on-prem installations.",
        "Created E2E tests for Azure build pipelines using Selenium; unit tests in Angular with Jasmine and Karma."
      ]
    },
    {
      "name": "RDK Truck Sales",
      "position": "Senior Software Engineer",
      "url": "https://www.rdk.com",
      "startDate": "2018-07",
      "endDate": "2020-05",
      "summary": "Led development of a custom CRM, handling system architecture and integrations.",
      "highlights": [
        "Architected and developed a CRM using .NET Core Web API, Angular 7, Azure SQL, and Azure DevOps.",
        "Integrated CRM with Procede Software’s Excede API for seamless data synchronization.",
        "Developed a Windows Service for third-party SQL actions and managed CI/CD workflows using Git Flow."
      ]
    },
    {
      "name": "Ashley Furniture",
      "position": "Senior Software Engineer",
      "url": "https://www.ashleyfurniture.com",
      "startDate": "2017-01",
      "endDate": "2018-07",
      "summary": "Developed security and user management systems for financial applications.",
      "highlights": [
        "Implemented OAuth and JWT security models.",
        "Developed Angular components for user roles and order processing.",
        "Built Azure CI/CD pipelines and enforced SOLID principles."
      ]
    },
    {
      "name": "Mercury New Media",
      "position": "Senior Software Engineer",
      "url": "https://www.mercurynewmedia.com",
      "startDate": "2016-09",
      "endDate": "2016-12",
      "summary": "Developed custom Sitefinity MVC widgets and client integrations.",
      "highlights": [
        "Created Sitefinity widgets for lead promotion and WordPress data import."
      ]
    },
    {
      "name": "352",
      "position": "Senior Software Engineer",
      "url": "https://www.352inc.com",
      "startDate": "2016-04",
      "endDate": "2016-08",
      "summary": "Developed client applications and backend services.",
      "highlights": [
        "Developed applications integrating affiliate networks using NodeJS, ExpressJS, MongoDB, and React."
      ]
    },
    {
      "name": "AAPL",
      "position": "Senior Software Engineer",
      "url": "https://www.physicianleaders.org",
      "startDate": "2014-02",
      "endDate": "2016-04",
      "summary": "Led initiatives to rebuild corporate web infrastructure.",
      "highlights": [
        "Rebuilt corporate website using Sitefinity CMS, integrating with Microsoft CRM and SQL Server.",
        "Developed APIs, web/mobile applications, and POS solutions to enhance operational efficiency."
      ]
    },
    {
      "name": "SOE Software",
      "position": "Senior Software Engineer",
      "url": "https://soesoftware.com",
      "startDate": "2009-09",
      "endDate": "2014-02",
      "summary": "Enhanced and maintained software solutions for election management, focusing on secure, scalable web applications.",
      "highlights": [
        "Developed and maintained critical software components for election management systems."
      ]
    },
    {
      "name": "RDK Truck Sales",
      "position": "Senior Software Engineer",
      "url": "https://www.rdk.com",
      "startDate": "2006-06",
      "endDate": "2009-09",
      "summary": "Architected and developed a comprehensive CRM solution, enhancing business operations through advanced integration and development practices.",
      "highlights": [
        "Developed a custom CRM and reporting web application that is used exclusively by RDK’s call center which handles heavy call volume dealing with commercial vehicle sales for international clients using ASP.NET, C#, JavaScript and SQL Server."
      ]
    },
    {
      "name": "Geographic Solutions",
      "position": "Senior Software Engineer",
      "startDate": "2006-01",
      "endDate": "2006-06",
      "summary": "Played a key role in developing workforce development software to manage unemployment benefits and job seeker tools.",
      "highlights": [
        "Contributed to software solutions for managing workforce development and unemployment benefit systems."
      ]
    },
    {
      "name": "PowerChord",
      "position": "Full Stack Developer",
      "startDate": "2003-11",
      "endDate": "2005-12",
      "summary": "Developed web applications that empowered manufacturing clients to manage their dealer networks effectively.",
      "highlights": [
        "Developed multi-tier web applications to enhance the dealer network capabilities of manufacturing clients."
      ]
    },
    {
      "name": "Sterling Star",
      "position": "WinForms Developer",
      "startDate": "2003-02",
      "endDate": "2003-11",
      "summary": "Focused on developing and enhancing medical billing software to improve efficiency and user experience.",
      "highlights": [
        "Enhanced and maintained medical billing software, integrating advanced reporting and data management tools."
      ]
    }
  ],
  "education": [
    {
      "institution": "Tampa Technical Institute",
      "area": "Internet Information Systems",
      "studyType": "Associate of Science",
      "startDate": "2001-01",
      "endDate": "2002-07"
    }
  ]
}